GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3r(e)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC01_IN0 */
#define ADC01_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC01_IN1 */
#define ADC01_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC01_IN13 */
#define ADC01_IN13_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)

/* ADC01_IN5 */
#define ADC01_IN5_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC01_IN6 */
#define ADC01_IN6_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC01_IN7 */
#define ADC01_IN7_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC01_IN8 */
#define ADC01_IN8_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC0_IN10 */
#define ADC0_IN10_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)

/* ADC0_IN11 */
#define ADC0_IN11_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ADC0_IN12 */
#define ADC0_IN12_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC0_IN2 */
#define ADC0_IN2_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC0_IN3 */
#define ADC0_IN3_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC0_IN4 */
#define ADC0_IN4_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)

/* ADC0_IN9 */
#define ADC0_IN9_PF0 \
	GD32_PINMUX_AF('F', 0, ANALOG)

/* ADC1_IN10 */
#define ADC1_IN10_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* ADC1_IN11 */
#define ADC1_IN11_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)

/* ADC1_IN12 */
#define ADC1_IN12_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* ADC1_IN14 */
#define ADC1_IN14_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)

/* ADC1_IN15 */
#define ADC1_IN15_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ADC1_IN2 */
#define ADC1_IN2_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* ADC1_IN3 */
#define ADC1_IN3_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* ADC1_IN4 */
#define ADC1_IN4_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* ADC1_IN9 */
#define ADC1_IN9_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)

/* ADC2_IN0 */
#define ADC2_IN0_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ADC2_IN11 */
#define ADC2_IN11_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC2_IN4 */
#define ADC2_IN4_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)

/* ADC3_IN16 */
#define ADC3_IN16_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)

/* ADC3_IN17 */
#define ADC3_IN17_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)

/* ADC3_IN2 */
#define ADC3_IN2_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)

/* ADC3_IN3 */
#define ADC3_IN3_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)

/* ADC3_IN4 */
#define ADC3_IN4_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PB8 \
	GD32_PINMUX_AF('B', 8, ANALOG)
#define ANALOG_PB9 \
	GD32_PINMUX_AF('B', 9, ANALOG)
#define ANALOG_PB10 \
	GD32_PINMUX_AF('B', 10, ANALOG)
#define ANALOG_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)
#define ANALOG_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)
#define ANALOG_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)
#define ANALOG_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)
#define ANALOG_PD2 \
	GD32_PINMUX_AF('D', 2, ANALOG)
#define ANALOG_PF0 \
	GD32_PINMUX_AF('F', 0, ANALOG)
#define ANALOG_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)
#define ANALOG_PG10 \
	GD32_PINMUX_AF('G', 10, ANALOG)

/* BOOT0 */
#define BOOT0_PB8 \
	GD32_PINMUX_AF('B', 8, AF0)

/* CAN0_RX */
#define CAN0_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF9)
#define CAN0_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF9)

/* CAN0_TX */
#define CAN0_TX_PA12 \
	GD32_PINMUX_AF('A', 12, AF9)
#define CAN0_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF9)

/* CAN1_RX */
#define CAN1_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF9)
#define CAN1_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF9)

/* CAN1_TX */
#define CAN1_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF9)
#define CAN1_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF9)

/* CAN2_RX */
#define CAN2_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF11)
#define CAN2_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF11)

/* CAN2_TX */
#define CAN2_TX_PA15 \
	GD32_PINMUX_AF('A', 15, AF11)
#define CAN2_TX_PB4 \
	GD32_PINMUX_AF('B', 4, AF11)

/* CK_HPDFAUDIO */
#define CK_HPDFAUDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF14)
#define CK_HPDFAUDIO_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)

