GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3r(e)xx-pinctrl.h
/* EXMC_A1 */
#define EXMC_A1_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)

/* EXMC_A10 */
#define EXMC_A10_PB13 \
	GD32_PINMUX_AF('B', 13, AF11)

/* EXMC_A11 */
#define EXMC_A11_PB14 \
	GD32_PINMUX_AF('B', 14, AF11)

/* EXMC_A12 */
#define EXMC_A12_PB15 \
	GD32_PINMUX_AF('B', 15, AF11)

/* EXMC_A13 */
#define EXMC_A13_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)

/* EXMC_A14 */
#define EXMC_A14_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* EXMC_A15 */
#define EXMC_A15_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* EXMC_A16 */
#define EXMC_A16_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)

/* EXMC_A17 */
#define EXMC_A17_PA4 \
	GD32_PINMUX_AF('A', 4, AF11)

/* EXMC_A18 */
#define EXMC_A18_PA5 \
	GD32_PINMUX_AF('A', 5, AF11)

/* EXMC_A19 */
#define EXMC_A19_PA6 \
	GD32_PINMUX_AF('A', 6, AF11)

/* EXMC_A2 */
#define EXMC_A2_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)

/* EXMC_A20 */
#define EXMC_A20_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* EXMC_A21 */
#define EXMC_A21_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)

/* EXMC_A22 */
#define EXMC_A22_PA9 \
	GD32_PINMUX_AF('A', 9, AF11)

/* EXMC_A23 */
#define EXMC_A23_PA10 \
	GD32_PINMUX_AF('A', 10, AF9)

/* EXMC_A24 */
#define EXMC_A24_PA11 \
	GD32_PINMUX_AF('A', 11, AF4)

/* EXMC_A25 */
#define EXMC_A25_PA12 \
	GD32_PINMUX_AF('A', 12, AF4)

/* EXMC_A3 */
#define EXMC_A3_PB2 \
	GD32_PINMUX_AF('B', 2, AF11)

/* EXMC_A4 */
#define EXMC_A4_PB6 \
	GD32_PINMUX_AF('B', 6, AF14)

/* EXMC_A5 */
#define EXMC_A5_PA13 \
	GD32_PINMUX_AF('A', 13, AF9)

/* EXMC_A6 */
#define EXMC_A6_PB9 \
	GD32_PINMUX_AF('B', 9, AF11)

/* EXMC_A7 */
#define EXMC_A7_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* EXMC_A8 */
#define EXMC_A8_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* EXMC_A9 */
#define EXMC_A9_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* EXMC_CLK */
#define EXMC_CLK_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)

/* EXMC_D0 */
#define EXMC_D0_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)

/* EXMC_D1 */
#define EXMC_D1_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NBL0 */
#define EXMC_NBL0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* EXMC_NBL1 */
#define EXMC_NBL1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)

/* EXMC_NE0 */
#define EXMC_NE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF12)

/* EXMC_NE1 */
#define EXMC_NE1_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)

/* EXMC_NE2 */
#define EXMC_NE2_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* EXMC_NE3 */
#define EXMC_NE3_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NOE */
#define EXMC_NOE_PC1 \
	GD32_PINMUX_AF('C', 1, AF12)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)

/* EXMC_NWE */
#define EXMC_NWE_PC2 \
	GD32_PINMUX_AF('C', 2, AF12)

/* HPDF_CKIN0 */
#define HPDF_CKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF0)
#define HPDF_CKIN0_PC0 \
	GD32_PINMUX_AF('C', 0, AF8)

/* HPDF_CKIN1 */
#define HPDF_CKIN1_PB2 \
	GD32_PINMUX_AF('B', 2, AF5)
#define HPDF_CKIN1_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)
#define HPDF_CKIN1_PC2 \
	GD32_PINMUX_AF('C', 2, AF8)

/* HPDF_CKIN2 */
#define HPDF_CKIN2_PB15 \
	GD32_PINMUX_AF('B', 15, AF10)
#define HPDF_CKIN2_PC4 \
	GD32_PINMUX_AF('C', 4, AF8)

/* HPDF_CKIN3 */
#define HPDF_CKIN3_PC6 \
	GD32_PINMUX_AF('C', 6, AF0)

/* HPDF_CKIN4 */
#define HPDF_CKIN4_PC1 \
	GD32_PINMUX_AF('C', 1, AF4)

/* HPDF_CKIN5 */
#define HPDF_CKIN5_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)
#define HPDF_CKIN5_PC10 \
	GD32_PINMUX_AF('C', 10, AF0)

/* HPDF_CKIN7 */
#define HPDF_CKIN7_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define HPDF_CKIN7_PB11 \
	GD32_PINMUX_AF('B', 11, AF6)

/* HPDF_CKOUT */
#define HPDF_CKOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF5)
#define HPDF_CKOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)

/* HPDF_DATAIN0 */
#define HPDF_DATAIN0_PB10 \
	GD32_PINMUX_AF('B', 10, AF3)
#define HPDF_DATAIN0_PC1 \
	GD32_PINMUX_AF('C', 1, AF8)

/* HPDF_DATAIN1 */
#define HPDF_DATAIN1_PB1 \
	GD32_PINMUX_AF('B', 1, AF5)
#define HPDF_DATAIN1_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)
#define HPDF_DATAIN1_PC3 \
	GD32_PINMUX_AF('C', 3, AF8)

/* HPDF_DATAIN2 */
#define HPDF_DATAIN2_PB14 \
	GD32_PINMUX_AF('B', 14, AF10)
#define HPDF_DATAIN2_PC5 \
	GD32_PINMUX_AF('C', 5, AF8)

/* HPDF_DATAIN3 */
#define HPDF_DATAIN3_PB11 \
	GD32_PINMUX_AF('B', 11, AF3)
#define HPDF_DATAIN3_PC7 \
	GD32_PINMUX_AF('C', 7, AF0)

/* HPDF_DATAIN4 */
#define HPDF_DATAIN4_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)

/* HPDF_DATAIN5 */
#define HPDF_DATAIN5_PB6 \
	GD32_PINMUX_AF('B', 6, AF0)
#define HPDF_DATAIN5_PC11 \
	GD32_PINMUX_AF('C', 11, AF0)

/* HPDF_DATAIN7 */
#define HPDF_DATAIN7_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)
#define HPDF_DATAIN7_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)

/* HRTIMER_EXEV0 */
#define HRTIMER_EXEV0_PC12 \
	GD32_PINMUX_AF('C', 12, AF3)

/* HRTIMER_EXEV1 */
#define HRTIMER_EXEV1_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)

/* HRTIMER_EXEV2 */
#define HRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* HRTIMER_EXEV3 */
#define HRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AF('B', 6, AF12)

/* HRTIMER_EXEV4 */
#define HRTIMER_EXEV4_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)

/* HRTIMER_EXEV5 */
#define HRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AF('B', 5, AF12)

/* HRTIMER_EXEV6 */
#define HRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AF('B', 4, AF12)

/* HRTIMER_EXEV7 */
#define HRTIMER_EXEV7_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)

/* HRTIMER_EXEV8 */
#define HRTIMER_EXEV8_PB3 \
	GD32_PINMUX_AF('B', 3, AF12)

/* HRTIMER_EXEV9 */
#define HRTIMER_EXEV9_PC5 \
	GD32_PINMUX_AF('C', 5, AF13)
#define HRTIMER_EXEV9_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)

/* HRTIMER_FLT0 */
#define HRTIMER_FLT0_PA12 \
	GD32_PINMUX_AF('A', 12, AF12)

/* HRTIMER_FLT1 */
#define HRTIMER_FLT1_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)

/* HRTIMER_FLT2 */
#define HRTIMER_FLT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)

/* HRTIMER_FLT3 */
#define HRTIMER_FLT3_PB11 \
	GD32_PINMUX_AF('B', 11, AF13)

/* HRTIMER_FLT4 */
#define HRTIMER_FLT4_PB0 \
	GD32_PINMUX_AF('B', 0, AF13)
#define HRTIMER_FLT4_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* HRTIMER_FLT5 */
#define HRTIMER_FLT5_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)

/* HRTIMER_FLT6 */
#define HRTIMER_FLT6_PC3 \
	GD32_PINMUX_AF('C', 3, AF13)

/* HRTIMER_FLT7 */
#define HRTIMER_FLT7_PC4 \
	GD32_PINMUX_AF('C', 4, AF13)

/* HRTIMER_SCIN */
#define HRTIMER_SCIN_PB2 \
	GD32_PINMUX_AF('B', 2, AF13)
#define HRTIMER_SCIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF12)

/* HRTIMER_SCOUT */
#define HRTIMER_SCOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF13)
#define HRTIMER_SCOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF12)

