GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3r(e)xx-pinctrl.h
/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)

/* SPI1_NSS */
#define SPI1_NSS_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define SPI1_NSS_PF0 \
	GD32_PINMUX_AF('F', 0, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF12)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PF1 \
	GD32_PINMUX_AF('F', 1, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN0 */
#define TIMER0_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define TIMER0_BRKIN0_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define TIMER0_BRKIN0_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)
#define TIMER0_BRKIN0_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)
#define TIMER0_BRKIN0_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)
#define TIMER0_BRKIN0_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define TIMER0_BRKIN0_PC13 \
	GD32_PINMUX_AF('C', 13, AF2)

/* TIMER0_BRKIN1 */
#define TIMER0_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF2)
#define TIMER0_BRKIN1_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)

/* TIMER0_BRKIN2 */
#define TIMER0_BRKIN2_PA11 \
	GD32_PINMUX_AF('A', 11, AF11)
#define TIMER0_BRKIN2_PC3 \
	GD32_PINMUX_AF('C', 3, AF6)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)
#define TIMER0_CH0_PC0 \
	GD32_PINMUX_AF('C', 0, AF2)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)
#define TIMER0_CH1_PC1 \
	GD32_PINMUX_AF('C', 1, AF2)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF6)
#define TIMER0_CH2_PC2 \
	GD32_PINMUX_AF('C', 2, AF2)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF11)
#define TIMER0_CH3_PC3 \
	GD32_PINMUX_AF('C', 3, AF2)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF11)
#define TIMER0_ETI_PC4 \
	GD32_PINMUX_AF('C', 4, AF2)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF6)
#define TIMER0_MCH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)
#define TIMER0_MCH0_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define TIMER0_MCH0_PC13 \
	GD32_PINMUX_AF('C', 13, AF4)

/* TIMER0_MCH1 */
#define TIMER0_MCH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)
#define TIMER0_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)
#define TIMER0_MCH1_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define TIMER0_MCH2_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)
#define TIMER0_MCH2_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)
#define TIMER0_MCH2_PF0 \
	GD32_PINMUX_AF('F', 0, AF6)

/* TIMER0_MCH3 */
#define TIMER0_MCH3_PC5 \
	GD32_PINMUX_AF('C', 5, AF6)

/* TIMER14_BRKIN0 */
#define TIMER14_BRKIN0_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)
#define TIMER14_BRKIN0_PC5 \
	GD32_PINMUX_AF('C', 5, AF2)

/* TIMER14_CH0 */
#define TIMER14_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF9)
#define TIMER14_CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)

/* TIMER14_CH1 */
#define TIMER14_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define TIMER14_CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)

/* TIMER14_MCH0 */
#define TIMER14_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define TIMER14_MCH0_PB15 \
	GD32_PINMUX_AF('B', 15, AF2)

/* TIMER15_BRKIN0 */
#define TIMER15_BRKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER15_CH0_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER15_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PA13 \
	GD32_PINMUX_AF('A', 13, AF1)
#define TIMER15_MCH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)

/* TIMER16_BRKIN0 */
#define TIMER16_BRKIN0_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER16_BRKIN0_PB4 \
	GD32_PINMUX_AF('B', 4, AF10)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER16_CH0_PB5 \
	GD32_PINMUX_AF('B', 5, AF10)
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)

/* TIMER19_BRKIN1 */
#define TIMER19_BRKIN1_PF1 \
	GD32_PINMUX_AF('F', 1, AF2)

/* TIMER19_CH0 */
#define TIMER19_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF3)

/* TIMER19_CH1 */
#define TIMER19_CH1_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)

/* TIMER19_CH2 */
#define TIMER19_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF6)

/* TIMER19_MCH0 */
#define TIMER19_MCH0_PB1 \
	GD32_PINMUX_AF('B', 1, AF7)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PA9 \
	GD32_PINMUX_AF('A', 9, AF10)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF14)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF14)

